# შექმენით საკუთარი ფუნქცია სახელად convert რომელის პარამეტრიც იქნება str ტიპის არგუმენტი - ტექსტი.
# convert ფუნქციაში არგუმენტად მიღებული ტექსტში იპოვეთ :) ან :( სიმბოლოები და გადააქციეთ ისინი შესაბამის (smile_emoji) და (frown_emoji) ემოჯიებად. დანარჩენი ტექსტი უნდა დარჩეს უცვლელი.
# იმავე faces.py ფუნცქიაში შექმენით მთავარი main ფუნქცია რომელიც სთხოვს მომხარებელს ტექსტის შყვანას (input), გამოიძახებს convert ფუნქციას და გადასცემს მომხმარებლის მიერ შეყვანილ ტექსტს არგუმენტად და convert - ის მიერ დაბრუნებულ შედეგს დაბეჭდავს ეკრანზე.
# დარწმუნდი რომ main ფუნქციას გამოიძახებ ფაილის ბოლოში და შენი კოდიც სტილისტურად ლამაზად გაქვს დალაგებული


def main():
    txt = input("enter your text: ")
    convert(txt)

def convert(user_text):
    print(user_text.replace(":)"," 😍 ").replace(":(", "🙁"))
    

main()