# ფუნქცია არის კოდის ნაწილის პაკეტი, რომელიც ასრულებს კონკრეტულ ამოცანას . ამ პაკეტის დახმარებით ერი და იგივე  კოდი შეგვიძლია სხვადასხვა ადგილას გამოვიყენო, დროის და ენერგიის დაზოგვით. ფუნქციას შეუძლია მიიღოს ინფორმაცია, იმუშაოს ამ ინფორმაციაზე და შემდეგ დააბრუნოს შედეგი. ფუნქციის დასაწერად პითონში ვიყენებთ სიტყვა def-ს, რაც ნიშნავს "დაადასტურე ფუნქცია.". შემდეგ ფუნქციას ვაძლევთ სასურველ სახელს და ვუთითებთ თუ რაუნდა შეასრულოს ფუნქციამ. 

name = input("enter your name: ")

def hello(to): # to არის პარამეტრი სადაც პირდაპირ გადმოკოპირდა name ცვლადში შეყვანილი მნიშვნელობა
    print(f"Hello {to}") 


hello(name) # ფუნქციის გამოსაძახებლად საჭიროა დავწეროთ ფუნქციის სახელი. ფრჩხილებში ფუნქციას გადავეცი არგუმენტად name ცვლადის მნიშვნელობა რასაც მომხმარებელი შეიყვანს