# sep / separator - არის დასახელებული არგუმენტი რომლის გამოყენებაც შეგვიძლა print ფუნქციაში. მისი საშუალებით ჩვენ შეგვიძლია print ფუნქციაში არგუმენტის შემდგომ დავწეროთ ნებირსმიერი სიმბოლო, სფეისები, ტექსტი ან ნებისმიერი რამ რასაც ჩავწერთ sep="" არგუმენტში.

# ვეკითხები მომხმარებელს სახელს 
name = input("enter your name: ")

# ვეკითხებით მომხმარებელს გვარს 
surname = input("enter your surname: ")

# end - არის დასახელებული არგუმენტი რომლის გამოყენებაც შეგვიძლია print ფუნქციაში. თუ ჩვენ print ფუნქციაში ჩავწერთ end = "" ჩვენი კურსორი პროგრამის დასრულების შემდეგ აღრ გადავა ახალ ხაზზე და საშუალებას მოგცემს წერა გავნაგრძოთ იმ ხაზიდან სადაც ბოლოს დასრულდა პროგრამა.

print("hello",name, surname, "how are you doing", sep=",", end="?")

# ფსევდო კოდი - არის კოდის დაწერამდე დასათაურებლი კოდის შინაარსი ანუ კოდის პირობა/დავალების პირობა რომელიც იწერება კომენტარი სახით.