# split - არის მეთოდი რომელიც სტირნგს ყოფს ნაწილებად და აბრუნებს სიას 

name = input("enter your name: ").capitalize().strip()#.title()

first, last = name.split()

print(f"Hello, {first}!")


# python-ში გვაქვს ოპერატორები რომლებიც საშუალებას გვაძლევს რიცხვებზე მოვახდინოთ მათემატიკური მოქმედებები 

print(5 + 10) # მიმატება
print(10 - 5) # გამოკლება 
print(10 / 2) # გაყოფა 
print(10 // 2) # მთელი გაყოფა 
print(10 * 2) # გამრავლება 
print(10 % 2) # ნაშთის დაბრუნება
print(10 ** 2) # ხარისხში აყვანა


# int - არის მთელი რიცხვი integer შემოკლებული ფორმა int 
